# Задание выполнено и код рабочий, часто этого достаточно, но я буду давать комментарии как сделать код лучше и как решить задачи правильнее
# Основное замечание по этому коду, что ты по 2 раза вычисляешь каждое значение, когда эти значения уже хранятся в переменных
# Правильным будет вычислить значения 1 раз, а затем просто обращаться к этим значениям по именам переменных
# Ниже показал, как я бы решал такую задачу

a = 3**5
b = (-8)/(-4)
c =  (100 % 3)

print(a) 
print(b) 
print(c)
print(a + b + c)
